Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Returns a reference to the object underlying VARIABLE (the same value that was originally returned by the C<tie> call that bound the variable to a package.) Returns the undefined value if VARIABLE isn't tied to a package.
es_es: Devuelve una referencia al objeto subyacente en VARIABLE (el mismo valor que fue devuelto originalmente por la llamada C<tie> que unía a la variable a un paquete). Devuelve el valor indefinido si la VARIABLE no está vinculada a un paquete.

source: Unlike C<my> or C<state>, which allocates storage for a variable and associates a simple name with that storage for use within the current scope, C<our> associates a simple name with a package (read: global) variable in the current package, for use within the current lexical scope.
es_es: A diferencia de C<my> o C<state>, que asignan almacenamiento para una variable y asocian un nombre sencillo con este almacenamiento para su uso dentro del ámbito actual, C<our> asocia un nombre sencillo con una variable de paquete (es decir: global) en el paquete actual, para su uso dentro del ámbito léxico actual.

source: will use smart matching because only I<one> of the operands is a boolean; the other uses smart matching, and that wins.
es_es: usará coincidencia inteligente, porque sólo I<uno> de los operandos es un valor booleano; los otros utilizan coincidencia inteligente, y el resultado será verdadero.

source: $output = `cmd 2>&1 1>/dev/null`;
es_es: $salida = `comando 2>&1 1>/dev/null`;

source: Without the braces, Perl would have looked for a $whospeak, a C<$who::0>, and a C<$who's> variable.
es_es: Sin las llaves, Perl buscaría por $quien_altavoz, y el paquete C<$quien::0>.

source: There's a problem with C<syscall(&SYS_pipe)>: it returns the file number of the read end of the pipe it creates, but there is no way to retrieve the file number of the other end.
es_es: Hay un problema con C<syscall(&SYS_pipe)>: devuelve el número de archivo de la lectura final de la tubería que crea, pero no hay manera de recuperar el número de archivo del otro extremo.

source: Some things to watch out for are:
es_es: Algunas cosas a tener en cuenta son:

source: \g1 [5] Backreference to a specific or previous group,
es_es: \g1 [5] Contrareferencia a un grupo específico o anterior,

source: Thanks to the people who reviewed this document for me, before it went public.
es_es: Las personas que han revisado este documento antes de su publicación.

source: Compare with L</use>, which can do a similar check at compile time.
es_es: Compare con L</use>, que puede hacer un control similar en tiempo de compilación.

source: Each chunk is converted separately to a value.
es_es: Cada fragmento se convierte en un valor por separado.

source: $seconds = $3;
es_es: $segundos = $3;

source: rename lib/unicode to lib/unicore to avoid case-insensitivity problems with lib/Unicode
es_es: cambiar el nombre de lib/unicode a lib/unicore para evitar problemas de mayúsculas y minúsculas, con lib/Unicode

source: In other words, lines after the here-doc syntax are compared with the terminating string line by line.
es_es: En otras palabras, las líneas que siguen a la sintaxis del documento incrustado son comparados con la línea de terminación de cadena, una a una.

source: Note that no whitespace may precede the C<< # >>, unlike modern C preprocessors.
es_es: Tenga en cuenta que no puede haber espacios en blanco delante de C<< # >>, a diferencia de preprocesadores C modernos.

source: Deleting from a hash tied to a DBM file deletes the entry from the DBM file.
es_es: Borrando de un hash enlazado a un archivo DBM, borra esa entrada del archivo DBM.

source: Perl doesn't match multiple characters in an inverted bracketed character class, which otherwise could be highly confusing.
es_es: Perl no coincide con caracteres múltiples en una clase invertida de caracteres entre corchetes, lo cual podría ser muy confuso.

source: This however (probably) raised the false expectation that the strict refs, vars and subs were being enforced (and that @ISA was somehow "declared").
es_es: Sin embargo, esto planteó (probablemente) la falsa expectativa de que los strict refs, vars y subs estaban siendo forzados (y que @ISA era, de alguna manera "declarada").

source: Moreover, these internal optimizations are not always applicable.
es_es: Por otra parte, estas optimizaciones internas no siempre son aplicables.

source: If you get tired of remembering which element of the return list contains which return value, by-name interfaces are provided in standard modules: C<File::stat>, C<Net::hostent>, C<Net::netent>, C<Net::protoent>, C<Net::servent>, C<Time::gmtime>, C<Time::localtime>, and C<User::grent>.
es_es: Si está cansado de recordar qué elemento de la lista devuelta contiene qué valor, existen interfaces por nombre, en módulos estándar: C<File::stat>, C<Net::hostent>, C<Net::netent>, C<Net::protoent>, C<Net::servent>, C<Time::gmtime>, C<Time::localtime> y C<User::grent>.

source: ISBN 1-59059-018-X [1st edition August 2002]
es_es: ISBN 1-59059-018-X [1ª edición - Agosto de 2002]

source: If you want to add a new parameter you will have to add it to the end of the list for backward compatibility, and this will probably make your list order unintuitive.
es_es: Si desea agregar un nuevo parámetro lo tendrá que añadir al final de la lista, para mantener la compatibilidad con versiones anteriores, y esto probablemente hará que su orden de lista sea poco intuitivo.

source: until ( condition ) {
es_es: until ( condición ) {

source: This bug has now been fixed.
es_es: Este error ya se ha solucionado.

source: The only implication of the term "native" on integers is that the limits for the maximal and the minimal supported true integral quantities are close to powers of 2.
es_es: La única implicación del término "nativo" para los enteros es que los límites máximo y mínimo de las cantidades verdaderamente enteras admitidas son cercanos a potencias de 2.

source: =head2 Building 32-bit Perl in Irix
es_es: =head2 Compilando Perl de 32 bit en Irix

source: perltoot Perl OO tutorial, part 1
es_es: perltoot Programación orientada a objetos, parte 1

source: The -C switch has changed in an incompatible way.
es_es: La opción -C ha cambiado de una forma incompatible.

source: say '$foo is an odd digit';
es_es: say '$foo es un dígito impar';

source: The C<if> statement is straightforward.
es_es: La instrucción C<if> es sencilla.

# print join(':', split(//, 'hi there!', -1)), " ";
source: print join(':', split(//, 'hi there!', -1)), "\n";
es_es: print join(':', split(//, 'hola aqui!', -1)), "\n";

source: Note that characters from 128 to 255 (inclusive) are by default internally not encoded as UTF-8 for backward compatibility reasons.
es_es: Tenga en cuenta que los caracteres de 128 a 255 (inclusive) son, por defecto, internamente no codificados como UTF-8, por razones de compatibilidad hacia atrás.

source: While the list of arguments might work fine for one, two or even three arguments, any more arguments become hard for the module user to remember, and hard for the module author to manage.
es_es: Si bien la lista de argumentos puede funcionar bien para uno, dos o incluso tres argumentos, los siguientes argumentos le serán más difícil de recordar para el usuario del módulo, y difícil de mantener para el autor del módulo.

source: If the delimiters are bracketing, nested pairs are also skipped.
es_es: Si los delimitadores están entre emparejados, las parejas anidadas también se omiten.

source: On unconnected sockets, you must specify a destination to I<send to>, in which case it does a sendto(2) syscall.
es_es: En sockets desconectados, debe especificar un destino I<adonde> enviarlo, en cuyo caso hace una llamada del sistema sendto(2).

source: While this new feature was not planned, it fell naturally out of PerlIO changes, and is to be considered an accidental feature.
es_es: Aunque esta nueva característica no fue planeada, apareció de forma natural de los cambios que se hicieron a PerlIO, y se considera una característica accidental.

source: =item s X</s> X<regex, single-line> X<regexp, single-line> X<regular expression, single-line>
es_es: =item s X</s> X<regex, single-line> X<regexp, single-line> X<regular expression, single-line> X<regex, una línea> X<expresión regular, una línea>

source: On the other hand, the leading symbol ('$' or '@') on the array or hash indicates whether you are getting back a singular value (a scalar) or a plural one (a list).
es_es: Por otra parte, el símbolo principal ('$' o '@') en el array o hash indica si va a obtener un valor singular (un escalar) o uno plural (una lista).

source: In scalar context, glob iterates through such filename expansions, returning undef when the list is exhausted.
es_es: En contexto escalar, glob itera a través de la expansión de nombres de archivo, devolviendo undef cuando se agote la lista.

source: and here's another.
es_es: y aquí otra.

source: Treats ARRAY as a stack by appending the values of LIST to the end of ARRAY.
es_es: Considera a ARRAY como una pila añadiendo los valores de LISTA al final de ARRAY.

source: (Within character classes C<\b> represents backspace rather than a word boundary, just as it normally does in any double-quoted string.) The C<\A> and C<\Z> are just like "^" and "$", except that they won't match multiple times when the C</m> modifier is used, while "^" and "$" will match at every internal line boundary.
es_es: (Dentro de las clases carácter, C<\b> representa el retroceso -I<backspace>- en lugar del límite de palabra, tal como lo hace normalmente en cualquier cadena doblemente entrecomillada). Los C<\A> y C<\Z> son como los "^" y "$", excepto que no coincidirán múltiples veces cuando se use el modificador C</m>, mientras que "^" y "$" coincidirán en cada límite de línea que contenga la cadena.

source: perl588delta - what is new for perl v5.8.8
es_es: perl588delta - qué hay de nuevo en perl v5.8.8

# printf "address is %*vX ", ":", $addr; # IPv6 address
source: printf "address is %*vX\n", ":", $addr; # IPv6 address
es_es: printf "dirección es %*vX\n", ":", $addr; # dirección IPv6

source: The focus is on elements of style which are visible to the users of a module, rather than those parts which are only seen by the module's developers.
es_es: La atención se centra en los elementos de estilo que son visibles para los usuarios de un módulo, en lugar de aquellas partes que sólo son vistos por los desarrolladores del módulo.

source: 5.8.4 23:59:59 GMT, Wednesday March 31st 2004
es_es: 5.8.4 23:59:59 GMT miércoles, 31 de marzo 2004

source: open(FH, $filename) or die "Can't open $filename: $!";
es_es: open(FH, $archivo) or die "No puedo abrir $archivo: $!";

source: In particular, characters C<"0"> and C<"1"> generate nybbles 0 and 1, as do bytes C<"\000"> and C<"\001">.
es_es: En particular, los caracteres C<"0"> y C<"1"> generan los nibles 0 y 1, así como los bytes C<"\000"> y C<"\001">.

source: The following lines are equivalent:
es_es: Las siguientes líneas son equivalentes:

source: Patterns are subject to an additional level of interpretation as a regular expression.
es_es: Los patrones están sujetos a un nivel adicional de interpretación como una expresión regular.

source: Each letter may optionally be followed by a number indicating the repeat count.
es_es: Cada letra puede ser seguida opcionalmente por un número que indica el número de repeticiones.

source: Now it's barely a skeleton as its whitewashed bones have fractured or eroded.
es_es: Ahora, sus huesos pelados, rotos o erosionados, solo se asemejan vagamente a un esqueleto.

source: In fact, an identifier within such curlies is forced to be a string, as is any simple identifier within a hash subscript.
es_es: De hecho, un identificador dentro de estos signos, se le fuerza a ser una cadena, como a cualquier identificador dentro del subíndice de un hash.

source: C<File::Copy> upgraded to version 2.09
es_es: C<File::Copy> actualizado a la versión 2.09

source: (This doesn't work with C<-t>, and you need to remember that lstat() and C<-l> leave values in the stat structure for the symbolic link, not the real file.) (Also, if the stat buffer was filled by an C<lstat> call, C<-T> and C<-B> will reset it with the results of C<stat _>).
es_es: (Esto no funciona con C<-t>, y necesita recordar que lstat() y C<-l> dejarán valores en la estructura stat para el enlace simbólico, no el archivo real). (También, si la memoria intermedia de stat se rellenó con una llamada C<lstat>, C<-T> y C<-B> serán reinicializados con los resultados de C<stat _>).

source: $n = "-12.34e56"; # number specified as a string
es_es: $n = "-12.34e56"; # número especificado como una cadena

source: default { say "I don't like anything" }
es_es: default { say "No me gusta nada" }

source: Avoid starting a new top-level hierarchy, especially if a suitable hierarchy already exists under which you could place your module.
es_es: Evite comenzar una nueva jerarquía de nivel superior, sobre todo si una jerarquía adecuada ya existe en virtud del cual se puede colocar su módulo.

source: is roughly equivalent to:
es_es: es casi equivalente a:

source: Opens a pair of connected pipes like the corresponding system call.
es_es: Abre un par de tuberías conectadas como lo hace correspondiente llamada al sistema.

source: Document C<make>/C<emake> more visibly
es_es: C<make>/C<emake> mejor documentado

source: Binary "-" returns the difference of two numbers.
es_es: Binario "-" devuelve la diferencia de dos números.

source: The default answers for the rest of the questions are usually sufficient.
es_es: Suele ser suficiente tomar el valor por defecto para las respuestas del resto de las preguntas.

source: exit 255; # last resort
es_es: exit 255; # último recurso

source: by Jeffrey E. F. Friedl
es_es: Jeffrey E. F. Friedl

source: =item unary &
es_es: =item unario &

source: =item unary *
es_es: =item unario *

source: /(.)(.)(.)(.)(.)(.)(.)(.)(.)\g10/ # \g10 is a backreference
es_es: /(.)(.)(.)(.)(.)(.)(.)(.)(.)\g10/ # \g10 es una contrareferencia

source: L<perlmodlib> lists the modules which came with your Perl installation.
es_es: L<perlmodlib> enumera los módulos incluidos en la instalación de Perl.

source: # add new columns to an existing row
es_es: # añadir nuevas columnas a una fila existente

source: Each character is just that: the character.
es_es: Cada carácter no es más que eso: un carácter.

source: This has a side effect when opening unnamed pipes in a shell script: there is no child process generated under.
es_es: Esto tiene un efecto secundario al abrir las tuberías anónimas en un script de shell: no se ha generado ningún proceso hijo.

source: nonassoc list operators (rightward)
es_es: no asoc. operadores de lista (por la derecha)

source: Now returns extra information.
es_es: Ahora devuelve información adicional.

source: Reflect the functionality of the module, not the implementation.
es_es: Refleje la funcionalidad del módulo, no la implementación.

source: They may be used only as separate tokens; they will not be interpolated into strings.
es_es: Sólo podrán ser utilizados como símbolos aislados; no se interpolarán dentro de cadenas.

source: Code freeze for the next maintenance release (5.8.5) will be on 30th June 2004, with release by mid July.
es_es: La congelación de código para la versión de mantenimiento siguiente (5.8.5) será el 30 de junio de 2004, con la publicación a mediados de julio.

source: =head2 Builtin operators and functions
es_es: =head2 Funciones y operadores integrados

source: For rounding to a certain number of digits, sprintf() or printf() is usually the easiest route.
es_es: Para redondear a un determinado número de dígitos, sprintf() o printf() suele ser el camino más fácil.

source: The functions in this section can serve as terms in an expression.
es_es: Las funciones de esta sección pueden servir como términos en una expresión.

source: The other core committers contributed most of the changes, and applied most of the patches sent in by the hundreds of contributors listed in F<AUTHORS>.
es_es: El otro grupo principal de colaboradores contribuyó con la mayor parte de los cambios, y aplicaron la mayoría de los parches enviados por cientos de colaboradores que figuran en F<AUTORES>.

source: The F<Changes> file for exhaustive details on what changed.
es_es: El archivo de F<Changes> (Cambios) para obtener más información exhaustiva sobre lo que ha cambiado.

source: Does the same thing that the listen(2) system call does.
es_es: Hace lo mismo que la llamada del sistema listen(2).

source: (This feature is slightly different from the previous C<Configure -Dinstallprefix=...>.) See F<INSTALL>.
es_es: (Esta característica es ligeramente diferente de la anterior C<Configure -Dinstallprefix=...>.) Vea F<INSTALL>.

source: =item C<(??{ code })> X<(??{})> X<regex, postponed> X<regexp, postponed> X<regular expression, postponed>
es_es: =item C<(??{ código })> X<(??{})> X<regex, pospuesto> X<regexp, pospuesto> X<expresión regular, pospuesto>

source: Process
es_es: Procesar

source: If you do this, the following idiom is recommended:
es_es: Si hace esto, se recomienda usar el siguiente modismo:

source: =item connect SOCKET,NAME X<connect>
es_es: =item connect SOCKET,NOMBRE X<connect>

source: first to get the correct constant definitions.
es_es: primero para obtener las definiciones de las constantes.

source: =head2 no warnings 'category' works correctly with -w
es_es: =head2 no warnings 'category' ahora funciona correctamente con -w

source: It also uses filehandle I<ARGV> internally.
es_es: Internamente, también utiliza el identificador de archivo <ARGV>.

source: As explained below in L</Extended Patterns> it is possible to explicitly specify modifiers that apply only to portions of a regular expression.
es_es: Como se ha explicado en L</Patrones extendidos>, es posible especificar explícitamente los modificadores que se aplican sólo a unas partes de una expresión regular.

source: printf '<%.10g>', 1; # prints "<1>"
es_es: printf '<%.10g>', 1; # imprime "<1>"

source: This allows you to interpolate regexes into larger regexes and not have to worry about the capture groups being renumbered.
es_es: Esto le permite interpolar expresiones regulares en grandes expresiones regulares y no tener que preocuparse por el cambio en la numeración de los grupos de captura.

source: * zero or more of the previous thing
es_es: * cero o más coincidencias de lo anterior

source: while (<$input>) { # note use of indirection if (/^#include "(.*)"/) { process($1, $input); next; } #... # whatever
es_es: while (<$entrada>) { # note el uso de la indirección if (/^#include "(.*)"/) { procesa($1, $input); next; } #... # cualquier otra cosa

source: The lowercase of any character outside the ASCII range is the character itself.
es_es: La minúscula de cualquier carácter fuera del rango ASCII es el propio carácter.

source: $result = sprintf("%08d", $number);
es_es: $resultado = sprintf("%08d", $numero);

source: =item print LIST
es_es: =item print LISTA

source: When modified by the C<while> or C<until> loop modifier, executes the BLOCK once before testing the loop condition.
es_es: Cuando se encuentra acompañado por los modificadores de bucle C<while> o C<until>, ejecuta el BLOQUE una vez antes de comprobar la condición del bucle.

source: =item Functions for list data X<list>
es_es: =item Funciones para lista de datos X<list> X<lista>

source: dprofpp -p program.pl
es_es: dprofpp -p programa.pl

source: Reads from the filehandle whose typeglob is contained in EXPR (or from C<*ARGV> if EXPR is not provided).
es_es: Lee del identificador de archivo cuyo I<typeglob> esté contenido en EXPR (o desde C<*ARGV> si se omite EXPR).

source: b A bit string (ascending bit order inside each byte, like vec()).
es_es: b Una cadena de bit (en orden de bit ascendente dentro de cada byte, como vec()).

source: This assertion may be used as a C<(?(condition)yes-pattern|no-pattern)> switch.
es_es: Esta aserción puede ser usada con un interruptor C<(?(condición)patrón-sí|patrón-no)>.

source: Otherwise, the C<< => >> operator behaves exactly as the comma operator or list argument separator, according to context.
es_es: De lo contrario, el operador C<< => >> se comporta exactamente como el operador coma o separador de lista de argumentos, según el contexto.

source: Tests the state of the source tree for various common errors.
es_es: Pruebas que detectan diversos errores comunes en el árbol de código fuente.

source: =head2 Setup Perl and utilities on VM/ESA
es_es: =head2 Instalación de Perl y de las utilerías en VM/ESA

source: Additionally, there are a number of "README" files with hints and tips about building and using Perl on a wide variety of platforms, some more common than others.
es_es: Además, hay una serie de archivos "README" con consejos y sugerencias sobre la construcción y el uso de Perl en una amplia variedad de plataformas, algunas más comunes que otras.

source: Calls flock(2), or an emulation of it, on FILEHANDLE.
es_es: Llama a flock(2), o una emulación de ella, sobre IDENTIFICADOR_ARCHIVO.

# print "Nice quads! ";
source: print "Nice quads!\n";
es_es: print "¡quads divertidos!\n";

source: See L<perlhist> (new as of 5.005) for Perl's milestone releases.
es_es: En L<perlhist> (nuevo desde la versión 5.005) está registrado el historial de lanzamiento de versiones de Perl.

source: @contact = sort(find_records (@key));
es_es: @contacto = sort(busca_registros (@claves));

source: It is recommended that for this usage you put the DEFINE block at the end of the pattern, and that you name any subpatterns defined within it.
es_es: Se recomienda que para este uso ponga el bloque DEFINE al final del patrón, y que dé nombre a cualquier sub-patrón definido dentro de él.

source: \033 [7,8] restricted range octal char (example: ESC)
es_es: \033 [7,8] rango restringido car. octal (ejemplo: ESC)

source: Binary "^" returns its operands XORed together bit by bit.
es_es: Binario "^" devuelve la operación XOR, bit a bit, de sus operandos.

source: Neither need quoting.
es_es: Ninguno necesita ser entrecomillado.

source: This is handy when you want to do a list assignment in a Boolean context, because most list functions return a null list when finished, which when assigned produces a 0, which is interpreted as FALSE.
es_es: Esto es útil cuando se quiere hacer una lista de asignación en un contexto booleano, porque la mayoría de funciones que devuelve una lista, devuelven una nula cuando han terminado, que cuando se asignan producen un 0, lo que se interpreta como FALSO.

source: =item sub NAME BLOCK X<sub>
es_es: =item sub NOMBRE BLOQUE X<sub>

source: On insecure systems, these restrictions may be relaxed, but this is not a portable assumption.
es_es: En sistemas inseguros, estas restricciones pueden estar más relajadas, pero no es una suposición normal.

source: Be careful with parentheses:
es_es: Tenga cuidado con los paréntesis:

source: C<diagnostics> upgraded to version 1.15
es_es: C<diagnostics> actualizado a la versión 1.15

source: If the C<< decimal string --> native integer >> conversion cannot be done without loss of information, the result is compatible with the conversion sequence C<< decimal_string --> native_floating_point --> native_integer >>.
es_es: Si no se puede aplicar la conversión C<< cadena decimal --> entero nativo >> sin pérdida de información, el resultado es compatible con la secuencia de conversiones C<< cadena decimal --> punto flotante nativo --> entero nativo >>.

source: Future versions of perl might do something different from the version of perl you try it out on.
es_es: Futuras versiones de perl pueden hacer algo diferente de la versión de perl que esté probando.
